Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
sequential (Sequential)      (256, 32)                 522720    
_________________________________________________________________
sequential_1 (Sequential)    (256, 1872)               524560    
=================================================================
Total params: 1,047,280
Trainable params: 1,047,280
Non-trainable params: 0
_________________________________________________________________